<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Управление запуском периодических задач
    |--------------------------------------------------------------------------
    */

    // Доступность обновления сертификатов
    'certificates' => (bool) env('JOB_CERTIFICATES', false),

    // Доступность задач синхронизации с Yclients
    'yclients' => (bool) env('JOB_YCLIENTS', false),

    // Уведомление об изменении данных сотрудников
    'staff_notifications' => (bool) env('JOB_STAFF_NOTIFICATIONS', false),
];
